---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightGroup.Dispose
source: html/096c2b00-033d-cd29-c075-9c1dc36f5ee1.htm
---
# Autodesk.Revit.DB.Lighting.LightGroup.Dispose Method

Releases all resources used by the LightGroup

## Syntax (C#)
```csharp
public void Dispose()
```